**** Ex 2.2.5
#+BEGIN_SRC clojure
;;(defn f [n] (+ (/ n 3) 2))
;;(defn f [n] (+ 10 (* n n)))
;;(defn f [n] (* 1/2 (+ 20 (* n n))))
(defn f [n] (- 2 (/ 1 n)))
(f 2)
(f 9)
#+END_SRC

#+RESULTS:
: #'user/f3/217/9
**** Exercise 2.3.2
#+BEGIN_SRC clojure
(defn sum-coins [p n d q] 
  (cl-format "%.2f"
    (+ (* p 0.01)
       (* n 0.05)
       (* d 0.10)
       (* q 0.25))))
(sum-coins 1 1 1 1)
#+END_SRC

#+RESULTS:
: 0.41

**** Exercise 2.3.3
#+BEGIN_SRC clojure
(defn total-profit [attendees]
    (- (* 5.00 attendees) 
       (+ 20.00 (* attendees 0.50))))
(total-profit 50)
#+END_SRC

#+RESULTS:
: #'user/total-profit205.0

